/*Теоретичні питання
Описати своїми словами навіщо потрібні функції у програмуванні. - функцією можна обгорнути якусь частину коду, яка буде використовуватись і викликать її стільки разів, скільки потрібно. також це допомогає зменшити кількість коду.
    Описати своїми словами, навіщо у функцію передавати аргумент. - для того, щоб можна було використовувати дані, які нам потрібні в саме цей момент, а не використовувать статичні дані з функції.
    Що таке оператор return та як він працює всередині функції?

    Завдання
    Реалізувати функцію, яка виконуватиме математичні операції з введеними користувачем числами. Завдання має бути виконане на чистому Javascript без використання бібліотек типу jQuery або React.

    Технічні вимоги:
    Отримати за допомогою модального вікна браузера два числа.
    Отримати за допомогою модального вікна браузера математичну операцію, яку потрібно виконати. Сюди може бути введено +, -, *, /.
Створити функцію, в яку передати два значення та операцію.
    Вивести у консоль результат виконання функції.
    Необов'язкове завдання підвищеної складності
Після введення даних додати перевірку їхньої коректності. Якщо користувач не ввів числа, або при вводі вказав не числа, - запитати обидва числа знову (при цьому значенням за замовчуванням для кожної зі змінних має бути введена інформація раніше). */


let number1 = +prompt("enter 1st number");
let number2 = +prompt("enter 2d number");
let action = prompt("enter action (+,-,*,/)");


const logResult = (number1, action, number2) => {
    if (action==="+") {
        let result = number1 + number2
        return console.log(result)
    }
    if (action==="-") {
        let result = number1 - number2
        return console.log(result)
    }
    if (action==="*") {
        let result = number1 * number2
        return console.log(result)
    }
    if (action==="/") {
        let result = number1 / number2
        return console.log(result)
    }
}
/* Або другий варіант
logResult(number1, action, number2)
const logResult1 = (num1 , num2, action ) =>{
    switch (action){
        case '+':return num1 + num2;
        case "-":return num1 - num2;
        case "*":return num1 * num2;
        case '/':return num1 / num2
    }
}
console.log(logResult1(1,2, "+")); */
