// Теоретичні питання
// Опишіть своїми словами, що таке метод об'єкту - це функція, яка належить певному об'єкту
// Який тип даних може мати значення властивості об'єкта? - значення можуть бути будь-якого типу
// Об'єкт це посилальний тип даних. Що означає це поняття? - змінна об'єкту дає лише посилання на місце в пам'яті, де зберігаються дані і фактично не містить їх

// Завдання
// Реалізувати функцію створення об'єкта "юзер". Завдання має бути виконане на чистому Javascript без використання бібліотек типу jQuery або React.
//
// Технічні вимоги:
//     Написати функцію createNewUser(), яка буде створювати та повертати об'єкт newUser.
// При виклику функція повинна запитати ім'я та прізвище.
// Використовуючи дані, введені юзером, створити об'єкт newUser з властивостями firstName та lastName.
// Додати в об'єкт newUser метод getLogin(), який повертатиме першу літеру імені юзера, з'єднану з прізвищем, все в нижньому регістрі (наприклад, Ivan Kravchenko → ikravchenko).
// Створити юзера за допомогою функції createNewUser(). Викликати у цього юзера функцію getLogin(). Вивести у консоль результат виконання функції.

let name = prompt("What is your name?")
let surname = prompt("What is your surname?")

const createNewUser = function () {
    return {
        firstName: name,
        lastName: surname,
        getLogin: function () {
            return `${name[0].toLowerCase() + surname}`
        }(),
    }
}

const user = new createNewUser()
console.log(user);


