// Як можна оголосити змінну у Javascript? - var, let i const
//     У чому різниця між функцією prompt та функцією confirm? - prompt виводить вікно з полем для вводу, а confirm - тільки з кнопками ок та відміна
//     Що таке неявне перетворення типів? Наведіть один приклад. - це перетворення, яке здійснюється автоматично. alert перетворить числові значення в рядок.

// Оголосіть дві змінні: admin та name. Встановіть ваше ім'я в якості значення змінної name. Скопіюйте це значення в змінну admin і виведіть його в консоль.

let userName = "Roman";
const admin = userName;
console.log(admin);

// Оголосити змінну days і ініціалізувати її числом від 1 до 10. Перетворіть це число на кількість секунд і виведіть на консоль.
let days = 2;
const daysToSeconds = days * 86400;
console.log(daysToSeconds);

//     Запитайте у користувача якесь значення і виведіть його в консоль.
let userNumber = prompt("enter numb pls")
console.log(userNumber);
